app/controllers/anagram_controller.rb

INSERT INTO "checks" ("text_a", "text_b", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text_a", "olá"], ["text_b", "láo"], ["created_at", "2015-12-15 19:08:55.414839"], ["updated_at", "2015-12-15 19:08:55.414839"]]
---
  def verify
  	@check=Check.create(check_params)